app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
  	@items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
  	@item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
  	@item = Item.find(params[:id])

INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Kitchen"], ["description", "Dishes"], ["created_at", "2016-05-24 22:53:01.136604"], ["updated_at", "2016-05-24 22:53:01.136604"]]
---
  def create
  	@item = Item.new(item_params)

  		if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "Sweep floors"], ["updated_at", "2016-05-25 00:43:34.355601"], ["id", 2]]
---
	def update
  	@item = Item.find(params[:id])

  		if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
  	Item.find(params[:id]).destroy